In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry', 'rohan', 'skillf', 'subha'],
    "mark":[92, 34, 24, 17],
    "city":['rampur', 'kolkata', 'barelly','balasore']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  mark      city
0   harry    92    rampur
1   rohan    34   kolkata
2  skillf    24   barelly
3   subha    17  balasore

In [5]:
df.to_csv('friend.csv')

In [6]:
df.to_csv('friend_indexFalse.csv', index=False)

In [7]:
df.head(2) # To show first two rows

    name  mark     city
0  harry    92   rampur
1  rohan    34  kolkata

In [8]:
df.tail(2) # To show last two rows

     name  mark      city
2  skillf    24   barelly
3   subha    17  balasore

In [9]:
df.describe() # To describe the numerical values of the data set

           mark
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [10]:
df

     name  mark      city
0   harry    92    rampur
1   rohan    34   kolkata
2  skillf    24   barelly
3   subha    17  balasore

In [12]:
df['name'][0] = 'Bubu'

C:\Users\mebub_9a7jdi8\AppData\Local\Temp\ipykernel_17300\1413192385.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['mark'][0] = '56'

In [13]:
df

     name mark      city
0    Bubu   56    rampur
1   rohan   34   kolkata
2  skillf   24   barelly
3   subha   17  balasore